Tekla Open API Reference for Tekla Structures 2025
Model.GetWorkPlaneHandler Method
 Returns a new work plane handler for the model. The work plane handler can be used to manipulate the current work plane in the model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public WorkPlaneHandler GetWorkPlaneHandler()
Public Function GetWorkPlaneHandler As WorkPlaneHandler
Return Value
Type: WorkPlaneHandler
The new work plane handler instance.
See Also
Reference
Model Class
Tekla.Structures.Model Namespace